templates/leftStripBendTemplate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            empty;
        nFaces          8372;
        startFace       8109;
    }
    fixedWalls
    {
        type            wall;
        nFaces          364;
        startFace       16481;
    }
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       16845;
    }
    outlet
    {
        type            patch;
        nFaces          35;
        startFace       16875;
    }
)

// ************************************************************************* //
